оаопр/src/Documents/ВыбытиеГостя/ВыбытиеГостя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыбытиеГостя</name>
  <basedOn>Document.РазмещениеГостя</basedOn>
  <registerRecords>InformationRegister.СостоянияНомеров</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтеля</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Бронирование</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроживанияСоСкидкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроживанияРанее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроживанияСоСкидкойРанее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

оаопр/src/InformationRegisters/ЦенаСуточногоПроживания/ЦенаСуточногоПроживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦенаСуточногоПроживания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КласНомера</name>
    <type>
      <types>CatalogRef.КлассыНомеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

оаопр/src/Enums/СостояниеНомера/СостояниеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеНомера</name>
  <enumValues>
    <name>Свободен</name>
  </enumValues>
  <enumValues>
    <name>Занят</name>
  </enumValues>
  <enumValues>
    <name>Бронь</name>
  </enumValues>
</mdclass:Enum>

оаопр/src/Documents/ВыбытиеГостя/ObjectModule.bsl
Процедура РасчетСтоимостиПроживания()
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦенаСуточногоПроживанияСрезПоследних.Цена КАК Цена
			|ИЗ
			|	РегистрСведений.ЦенаСуточногоПроживания.СрезПоследних(&Дата, КласНомера = &Класс) КАК ЦенаСуточногоПроживанияСрезПоследних";
	Запрос.УстановитьПараметр("Дата", ДатаНачала);
	Запрос.УстановитьПараметр("Класс", НомерОтеля.КлассНомера);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Цена=ВыборкаДетальныеЗаписи.Цена;
	Если Цена=0 Тогда
		СП=Новый СообщениеПользователю;
		СП.Текст="НЕ ВВедена цена на этот номер!Стоимость не будет посчитана!" ;
		СП.Сообщить();
	КонецЕсли;
	КолДней=Окр((ДатаОкончания-ДатаНачала)/86400,0)+1;
	СтоимостьПроживания=КоличествоМест*Цена*КолДней;
	Если Клиент.ИмеетСкидку Тогда
		Скидка= КоличествоМест*Цена*КолДней*Клиент.ПроцентСкидки/100;
		СтоимостьПроживанияСоСкидкой=СтоимостьПроживания-Скидка;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	  	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РасчетСтоимостиПроживания();
	Если СтоимостьПроживания=0 Тогда
		СП=Новый СообщениеПользователю;
		СП.Текст="Стоимость НЕ посчитана!" ;
		СП.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РазмещениеГостя") Тогда
		// Заполнение шапки
		ДатаНачала = ДанныеЗаполнения.ДатаНачала;
		ДатаОкончания = ДанныеЗаполнения.ДатаОкончания;
		Клиент = ДанныеЗаполнения.Клиент;
		КоличествоМест = ДанныеЗаполнения.КоличествоМест;
		НаличиеСкидки = ДанныеЗаполнения.НаличиеСкидки;
		НомерОтеля = ДанныеЗаполнения.НомерОтеля;
		Организация = ДанныеЗаполнения.Организация;
		СтоимостьПроживанияРанее = ДанныеЗаполнения.СтоимостьПроживания;
		СтоимостьПроживанияСоСкидкойРанее = ДанныеЗаполнения.СтоимостьПроживанияСоСкидкой;
		ДокументОснование = Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.СостоянияНомеров.Записывать=Истина;
	Если ДокументОснование.ДатаОкончания < ДатаОкончания Тогда
		ТекДата =ДокументОснование.ДатаОкончания;
		Пока ТекДата < ДатаОкончания Цикл
			Движение = Движения.СостоянияНомеров.Добавить();
			Движение.НомерОтеля = НомерОтеля;
			Движение.Дата = ТекДата;
		    Движение.Период=Дата;
			Движение.КоличествоМест = КоличествоМест;
			Движение.Состояние=Перечисления.СостояниеНомера.Свободен;
			ТекДата = ТекДата + 60 * 60 * 24; 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
